  {
    "@context"    : "http://schema.org/",
    "@type"       : "Recipe",
    "url"         :  "https://www.seriouseats.com/recipes/2016/01/charred-salsa-verde-tomatillo-salsa.html",
    "name"        : "Charred Salsa Verde Recipe",
    "datePublished" : "2016-01-26T14:15:00",
    "dateModified" : "2020-04-17T18:04:07",
    "description" : "This is my favorite salsa, hands down, and that's coming from someone who loves salsa. Smoky, spicy, sweet, bright, and complex, this is the one salsa to rule them all. The fact that it only has four real ingredients, you can make it in 20 minutes, and it requires pretty much no knife work or clean up is just the icing on the cake (or the salsa on the taco, maybe).",
    "image" : [
      "https://res.cloudinary.com/dqe01vujx/w_250,q_auto/recipe-images/charred-salsa-verde"
    ],
    "aggregateRating" : {
      "@type" : "AggregateRating",
      "ratingValue" : "5",
      "ratingCount" : "8"
    },
    "recipeCuisine" : "Mexican",
    "recipeCategory" : [
      "Salsa",
"Christmas",
"Cinco de Mayo",
"Dairy-Free",
"Gluten-Free",
"Low-Carb",
"Memorial Day",
"Vegan",
"Vegetarian"
    ],
    "recipeYield" : "Makes about 3 cups",
    "totalTime" : "PT00H20M",
    "recipeIngredient" : [
      "<val>1 1/2</val> pounds tomatillos, husks removed, split in half (680g; about 10 medium)",
"<val>1</val> medium white onion, peeled and split in half (about 6 ounces; 170g)",
"<val>2</val> to <val>4</val> Serrano or jalapeño chilies (adjust according to spice tolerance, remove seeds and ribs for milder spice), split in half",
"<val>10</val> to <val>15</val> sprigs cilantro, tough lower stems discarded",
"<val>1</val> tablespoon vegetable oil",
"Kosher salt"
    ],
    "recipeInstructions" : [
      {"@type" : "HowToStep", "text" : "Adjust oven rack to 4 inches below broiler and preheat broiler to high. Place tomatillos, onion, and chilies on a foil-lined rimmed baking sheet. Broil until darkly charred and blackened on top and tomatillos are completely tender, 6 to 12 minutes"},
{"@type" : "HowToStep", "text" : "Transfer vegetables and their juice to a blender, food processor, or the cup of an immersion blender. Add half of cilantro. Blend in pulses until a rough puree is formed."},
{"@type" : "HowToStep", "text" : "Heat oil in a medium saucepan over high heat until shimmering. Pour salsa into the hot oil all at once (it will steam and sputter). Immediately start stirring and continue to cook, stirring, until salsa is darkened and thick enough to coat the back of the spoon, about 3 minutes. Remove from heat."},
{"@type" : "HowToStep", "text" : "Finely chop remaining cilantro and stir into salsa. Season to taste with salt. Let cool, then serve. Salsa can be stored in the refrigerator for up to 5 days."}
    ],
    "author" : {
    "@type" : "Person",
    "name" : "J. Kenji López-Alt",
    "jobTitle" : "Chief Culinary Advisor",
    "sameAs" : [
      "https://www.facebook.com/kenjilopezalt/", "https://www.twitter.com/@kenjilopezalt"
    ],
    "description" : "J. Kenji López-Alt is a stay-at-home dad who moonlights as the Chief Culinary Consultant of Serious Eats and the Chef/Partner of Wursthall, a German-inspired California beer hall near his home in San Mateo. His first book,  The Food Lab: Better Home Cooking Through Science (based on his Serious Eats column of the same name) is a New York Times best-seller, recipient of a James Beard Award, and was named Cookbook of the Year in 2015 by the International Association of Culinary Professionals. Kenji's next project is a children’s book called Every Night is Pizza Night, to be released in 2020, followed by another big cookbook in 2021.",
    "url" : "https://www.seriouseats.com/user/profile/kenjilopezalt"
  },
    "keywords" : "easy, salsa, tomatillo"
  }
  