{
    "@context": "http:\/\/schema.org",
    "@type": "Recipe",
    "mainEntityOfPage": "True",
    "name": "Easy Cookie Icing",
    "url": "https:\/\/sallysbakingaddiction.com\/easy-glaze-icing\/",
    "image": [ "https://res.cloudinary.com/dqe01vujx/w_250,q_auto/recipe-images/white-sugar-cookie-icing" ],
    "author": {
        "@type": "Person",
        "name": "Sally"         
    },
    "description": "If you need a cookie decorating alternative to traditional royal icing, this sugar cookie icing is a great choice. It's like a very thick glaze. This icing takes awhile to dry, about 24 hours, and you can't pipe detail very well, but if you want simple decoration and a simple icing, this is it!",
    "recipeCuisine": "American",
    "keywords": "easy cookie icing",
    "recipeCategory": [
        
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Using a fork, stir the confectioners’ sugar, vanilla, corn syrup, and 4.5 Tablespoons (67ml) of water together in a medium bowl. It will be very thick and almost impossible to stir. Switch to a whisk and whisk in 1/2 Tablespoon (8ml) of water. If you lift the whisk and let the icing drizzle back into the bowl, the ribbon of icing will hold shape for a few seconds before melting back into the icing. That is when you know it’s the right consistency and is ready to use. If it&#8217;s too thick (sometimes it is), whisk in another 1/2 Tablespoon (8ml) of water or a little more until you reach the consistency."                   
        },
        {
            "@type": "HowToStep",
            "text": "If desired, stir in gel food coloring. You can pour some icing into different bowls if using multiple colors. When tinting icing, only use 1-2 drops at first, stir it in, then add more as needed to reach your desired color. Remember, color darkens as icing dries."                 
        },
        {
            "@type": "HowToStep",
            "text": "Spoon icing into squeeze bottles or piping bags fitted with Wilton Piping Tip #4. Decorate your cookies as desired. I usually outline cookies with icing first, then fill in the middle. If adding sprinkles on top of the icing, add them right after applying icing on your cookie."                    
        },
        {
            "@type": "HowToStep",
            "text": "Feel free to enjoy cookies before icing completely dries. Icing dries in 24 hours. No need to cover the decorated cookies as you wait for the icing to set. If it’s helpful, decorate the cookies directly on a baking sheet so you can stick the entire baking sheet in the refrigerator to help slightly speed up the icing setting. Once the icing has dried, these cookies are great for gifting or for sending."                    
        },
        {
            "@type": "HowToStep",
            "text": "The shelf life of your decorated cookies depends on the cookie recipe you are using. If using my sugar cookies, cover and store decorated cookies for up to 5 days at room temperature or up to 10 days in the refrigerator."                    
        },
        {
            "@type": "HowToStep",
            "text": "If not decorating right away, cover the icing tightly and keep in the refrigerator for up to 2 days. You can store in piping bags (with clips or rubber bands to seal ends), in squeeze bottles, or covered in bowl or container. Bring to room temperature before using. If icing has thickened up, add a few drops of water and mix in to thin out. Depending how you stored the icing (squeeze bottle/piping bag/container or bowl) shake squeeze bottle to mix/massage piping bag to mix/whisk in bowl or container to mix."
        }
    ],
    "recipeIngredient": [
        "<val>3</val> cups (<val>360</val>g) confectioners’ sugar",
        "<val>1/2</val> teaspoon&nbsp;pure vanilla extract&nbsp;(omit and replace with water for stark white icing)",
        "<val>2</val> teaspoons light corn syrup",
        "<val>4.5</val> - <val>5</val> Tablespoons (<val>67</val>-<val>75</val>ml) room temperature water",
        "pinch of salt"
    ],
    "prepTime": "PT5",
    "totalTime": "PT15",
    "recipeYield": "about 1.5 cups icing"
}